---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForMaterialTakeoff
zh: 明细表
source: html/87a6e8ff-bf0e-94f3-354f-bb498c335f23.htm
---
# Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForMaterialTakeoff Method

**中文**: 明细表

Gets a list of categories that can be used for a material takeoff.

## Syntax (C#)
```csharp
public static ICollection<ElementId> GetValidCategoriesForMaterialTakeoff()
```

## Returns
The IDs of all valid categories.